import random
import time
strelochka = ">>>--->"
start = """█▀▄▀█ ▄███▄   ▄█▄     ▄  █     ██   ██▄       ▄   ▄███▄      ▄     ▄▄▄▄▀ ▄   █▄▄▄▄ ▄███▄
█ █ █ █▀   ▀  █▀ ▀▄  █   █     █ █  █  █       █  █▀   ▀      █ ▀▀▀ █     █  █  ▄▀ █▀   ▀
█ ▄ █ ██▄▄    █   ▀  ██▀▀█     █▄▄█ █   █ █     █ ██▄▄    ██   █    █  █   █ █▀▀▌  ██▄▄
█   █ █▄   ▄▀ █▄  ▄▀ █   █     █  █ █  █   █    █ █▄   ▄▀ █ █  █   █   █   █ █  █  █▄   ▄▀
   █  ▀███▀   ▀███▀     █         █ ███▀    █  █  ▀███▀   █  █ █  ▀    █▄ ▄█   █   ▀███▀
  ▀                    ▀         █           █▐           █   ██        ▀▀▀   ▀
                                ▀            ▐
Ласкаво просимо, мандрівнику!

Ви опинилися біля входу в таємниче та старовинне підземелля.
Повітря насичене очікуванням, і єдине джерело світла -- ваш
надійний факел. Ваше серцебиття прискорюється, коли ви готуєтеся
вирушити в небезпечну подорож, сповнену викликів, скарбів і
неймовірних пригод.

Ваша доля чекає глибоко в цих темних і звивистих коридорах.
Докажете, що ви герой, чи підземелля забере ще одну жертву?
Вибір за вами.

Приготуйтеся, відважний шукаче пригод, і нехай ваша кмітливість
і відвага проведуть вас через невідоме. Ваша пригода починається зараз!"""

character = """▄█▄     ▄  █ ██   █▄▄▄▄ ██   ▄█▄      ▄▄▄▄▀ ▄███▄   █▄▄▄▄ 
█▀ ▀▄  █   █ █ █  █  ▄▀ █ █  █▀ ▀▄ ▀▀▀ █    █▀   ▀  █  ▄▀ 
█   ▀  ██▀▀█ █▄▄█ █▀▀▌  █▄▄█ █   ▀     █    ██▄▄    █▀▀▌  
█▄  ▄▀ █   █ █  █ █  █  █  █ █▄  ▄▀   █     █▄   ▄▀ █  █  
▀███▀     █     █   █      █ ▀███▀   ▀      ▀███▀     █   
         ▀     █   ▀      █                          ▀    
              ▀          ▀                                

Перш ніж ви вирушите у свою епічну подорож, нам потрібно створити 
вашого персонажа. Для початку надайте такі відомості:"""

level_1 = """█     ▄███▄      ▄   ▄███▄   █         ████▄    ▄   ▄███▄   
█     █▀   ▀      █  █▀   ▀  █         █   █     █  █▀   ▀  
█     ██▄▄   █     █ ██▄▄    █         █   █ ██   █ ██▄▄    
███▄  █▄   ▄▀ █    █ █▄   ▄▀ ███▄      ▀████ █ █  █ █▄   ▄▀ 
    ▀ ▀███▀    █  █  ▀███▀       ▀           █  █ █ ▀███▀   
                █▐                           █   ██         
                ▐                                   
Коли ви заходите глибше в підземелля, ви натрапляєте на містичну кімнату, 
охоплену моторошним м’яким сяйвом. У центрі кімнати ви знаходите 
старовинний вишуканий постамент, на якому лежить кришталева куля. 
Усередині кулі ви бачите закручений вихор чисел.

Таємничий голос лунає камерою:

«Ласкаво просимо, хоробрий шукаче пригод, до Кімнати чарівної загадки. 
Щоб продовжити, ви повинні довести свою кмітливість. 
Ось я загадую вам загадку. Вгадайте правильне число, і шлях відкриється».

Кришталева куля починає мерехтіти, відкриваючи загадку:

«Я — число від 0 до 10, приховане в тумані часу й магії. 
У вас є три спроби розкрити мою таємницю. Обирайте мудро».

Ви витрачаєте хвилинку, щоб поміркувати над загадкою, а 
потім робите своє перше припущення. """

bigger_answer_l1 = f"""Кришталева куля реагує, і голос відповідає:

«Вихор заворушився, але ваша здогадка не зовсім вірна. Справжнє
число більше . Спробуйте ще раз»."""
lower_answer_l1 = f"""Кришталева куля реагує, і голос відповідає:

«Вихор заворушився, але ваша здогадка не зовсім вірна. Справжнє
число меньше . Спробуйте ще раз»."""

last_try = """Коли ви робите свою останню спробу, кристалічна куля пульсує в очікуванні. 
Голос повертається востаннє:

«Ах, ви дійшли до своєї останньої спроби. Подивимося, 
чи прихильною до вас сьогодні буде доля».

Ваше серце прискорюється, поки ви очікуєте остаточного вердикту кулі. 
Успіх може виявити шлях вперед, але невдача може мати непередбачені 
наслідки. Містична кімната затамувала подих, чекаючи вашого рішення.

Ви розгадаєте Зачаровану Загадку і продовжите свою пригоду, 
чи секрети кімнати залишаться закритими?"""

victory_lv1 = """Зі сплеском очікування ви робите припущення, і кришталева куля 
відповідає яскравим сяючим світлом. Камера злегка тремтить, і ви 
знову чуєте голос, сповнений схвалення:

«Вітаю, відважний шукаче пригод! Ви розкрили таємницю Зачарованої загадки. 
Магія в кімнаті відповідає вашій мудрості».

Коли світло гасне, стародавній постамент опускається на підлогу, 
відкриваючи прохід, що веде глибше в підземелля. 
Ви успішно пройшли перше випробування і тепер стоїте на порозі 
більших пригод. Ваша подорож триває, сповнена таємниць, викликів 
і скарбів, які ще належить відкрити.

Тисніть далі, бо доля кличе ваше ім'я»."""

loosing_lv1 = """Ви пробували тричі, але марно. Чарівна кришталева куля оцінює ваші 
спроби і урочисто заявляє:

«Сьогодні доля тобі не була прихильною, відважний шукаче пригод. 
Твоїх знань виявилося недостатньо, і ти не пройшов випробування».

З невідомих причин темрява огортає стелю кришталевої кулі, 
і ви відчуваєте холодне дихання, яке огортає вас. 
Ваш світ зникає через ваші неправильні відповіді.

Для вас гра підійшла до кінця, але, можливо, 
ще один шукач пригод наважиться випробувати свої сили в 
цій стародавній та таємничій кімнаті.

Кінець твоєї подорожі. Ваша історія завершується»."""

level_2 = """\n█     ▄███▄      ▄   ▄███▄   █            ▄▄▄▄▀ ▄ ▄   ████▄ 
█     █▀   ▀      █  █▀   ▀  █         ▀▀▀ █   █   █  █   █ 
█     ██▄▄   █     █ ██▄▄    █             █  █ ▄   █ █   █ 
███▄  █▄   ▄▀ █    █ █▄   ▄▀ ███▄         █   █  █  █ ▀████ 
    ▀ ▀███▀    █  █  ▀███▀       ▀       ▀     █ █ █        
                █▐                              ▀ ▀         
                ▐                                           
                

Ви опиняєтесь у великому залі, прикрашеному розкішними гобеленами та 
складним різьбленням. У центрі кімнати є троє вишуканих дверей, 
кожна з яких веде до іншого таємничого пункту призначення. 
Коли ви наближаєтеся, залою лунає чарівний голос:

«Ласкаво просимо назад, безстрашний шукаче пригод, 
у місце, де буде перевірена інтуїція. Ви стоїте перед 
парадоксом Монті Голла, головоломкою ймовірностей і варіантів. 
Чи готові ви розгадати його таємниці?»

Голос продовжує:

«За одними з цих трьох дверей ховається неймовірний скарб, 
а за двома іншими, ну, скажімо так, є щось менш бажане. 
Ваша мета проста: вибрати одні двері.

Коли ви розмірковуєте над загадковим викликом, який стоїть перед вами, 
голос підбадьорює вас:

«Зроби свій вибір мудро, авантюристe, і нехай парадокс Монті Голла 
почнеться!»"""

victory_lv2 = """Прийнявши продумане рішення, ви зробите свій вибір. 
Голос схвально киває, а потім драматично заявляє:

«Дозвольте нам відкрити правду за обраними вами дверима».

Вибрані вами двері повільно відчиняються, і, на ваше здивування, 
перед вами розсипається приголомшлива низка скарбів. 
Золоті монети, дорогоцінні камені та артефакти невимовної цінності 
виблискують у м’якому світлі кімнати (Ви виграли).

Голос знову промовляє, сповнений захоплення:

«Вітаю, мудрий шукаче пригод! Ви подолали парадокс Монті-Голла та 
заволоділи бажаним скарбом. Ваша інтуїція та сміливість виправдалися».

Коли ви насолоджуєтеся своєю перемогою, ви не можете не відчувати 
почуття досягнення та хвилювання перед пригодами, 
які чекають попереду. Ви ще раз довели свою мужність, 
і ваша подорож продовжується, насиченішою та захопливішою, 
ніж будь-коли раніше.

Молодець! Ваша перемога штовхає вас далі в серце невідомого»."""

loosing_lv2 = """Затамувавши подих, ви спостерігаєте, як двері, які ви обрали, 
відкриваються, відкриваючи жахливе та смертоносне видовище. 
Замість скарбів ви опиняєтеся лицем до лиця з кімнатою, 
що кишить лютими дикими тиграми, їхні очі жадібно дивляться на вас.

Голос говорить, його тон сповнений жалю та занепокоєння:

«Лихо спіткало вас, авантюристе. За дверима, які ви вибрали, 
чекала неприборкана й небезпечна доля. Тигри прагнуть наступної 
їжі, і, здається, ви в меню».

Коли жах стискає ваше серце, ви розумієте, що ваша подорож 
закінчилася трагічно. Ваша пригода закінчується тут, у цій жахливій 
кімнаті приреченості. Скарб, який ви шукали, назавжди залишається 
недосяжним, а Парадокс Монті Холла набуває нового та жахливого значення.

У світі пригод вибір може призвести до тріумфу чи трагедії.
Ваша історія закінчилася, але запам’ятайте її як повчальну історію 
для тих, хто наважується вирушити в невідоме.

Гра закінчена, відважний авантюристе. Нехай ви знайдете спокій 
у великому за межами світі»."""

level_3 = """
█     ▄███▄      ▄   ▄███▄   █            ▄▄▄▄▀ ▄  █ █▄▄▄▄ ▄███▄   ▄███▄   
█     █▀   ▀      █  █▀   ▀  █         ▀▀▀ █   █   █ █  ▄▀ █▀   ▀  █▀   ▀  
█     ██▄▄   █     █ ██▄▄    █             █   ██▀▀█ █▀▀▌  ██▄▄    ██▄▄    
███▄  █▄   ▄▀ █    █ █▄   ▄▀ ███▄         █    █   █ █  █  █▄   ▄▀ █▄   ▄▀ 
    ▀ ▀███▀    █  █  ▀███▀       ▀       ▀        █    █   ▀███▀   ▀███▀   
                █▐                               ▀    ▀                    
                ▐                                                          

Ви просуваєтеся глибше в підземелля, залишаючи позаду загадковий 
Парадокс Монті Голла. Просуваючись вперед, ви потрапляєте в камеру, 
яка не схожа на жодну з тих, з якими ви стикалися раніше. 
Повітря насичене таємничою енергією, а стіни переливаються стародавніми 
рунами.

Владний голос лунає камерою:

«Ласкаво просимо, шукаче знань, у Кімнату містичних рівнянь. 
Тут сама тканина магії переплітається з математикою, 
і ваші навички будуть перевірені у найнезвичайніший спосіб».

Голос продовжує:

«Перед вами лежить низка зачарованих рівнянь, кожне з яких тримає ключ, 
щоб відкрити наступну частину вашої подорожі. 
Ці рівняння — не звичайні головоломки; вони — втілення магічних сил, 
які чекають, поки ви розгадаєте їхні таємниці».

Дивишся на рівняння, і здається, що вони зміщуються і трансформуються, 
ніби живі. Голос пояснює:

«Щоб рухатися вперед, ви повинні розв’язати ці містичні рівняння. 
Час — ваш ворог, бо магія, яка зв’язує їх, швидкоплинна. 
Швидко розв’язуйте кожне рівняння, або можливість зникне».

Перед вами постає перше рівняння, і ви відчуваєте терміновість 
поставленого завдання. Голос завершує:

«Приготуйся, відважний шукаче пригод. Кімната містичних рівнянь чекає, 
і лише твій інтелект і швидке мислення відкриють шлях попереду».

З почуттям рішучості ви крокуєте вперед, щоб розібратися з магічними 
рівняннями, знаючи, що кожне рішення наближає вас до серця таємниць 
підземелля."""

victory_lv3 = """З рішучістю та швидким мисленням ви вирішуєте кожне з 
містичних рівнянь, представлених перед вами. 
Коли ваші відповіді узгоджуються з прихованою в них магією, 
у кімнаті відбувається глибока трансформація.

Таємнича енергія зривається, а стіни Кімнати містичних 
рівнянь резонують потужним зачаруванням. Перед вами 
матеріалізується блискучий портал світла, що веде до нового 
шляху глибше в підземелля.

Владний голос знову говорить, сповнений захоплення:

«Чудово! Ваш інтелект і рішучість розкрили секрети 
Кімнати містичних рівнянь. Ви використали магію всередині 
себе й заслужили право продовжити».

З почуттям виконаного обов’язку ви проходите через портал, 
готовий зіткнутися з будь-якими викликами та таємницями, 
які вас чекають попереду. Ваша пригода продовжується, 
керуючись новознайденим пануванням над містичними силами, 
які мешкають у цих стародавніх глибинах.

Молодець, відважний авантюристе! Ваша подорож у невідоме 
продовжується»."""

loosing_lv3 = """Коли ви гарячково намагаєтеся розв’язати останнє містичне 
рівняння, ви відчуваєте, як енергія в камері стає все 
більш нестабільною. Рівняння протистоять вашим зусиллям, 
а магічні символи починають мерехтіти та зникати.

Час вислизає крізь ваші пальці, як пісок, і коли минають 
останні секунди, рівняння розчиняються у вирі хаотичної магії. 
Камера тремтить, і вас охоплює прилив містичної енергії.

Владний голос говорить востаннє, його тон сповнений жалю:

«На жаль, шукаче пригод, пісок часу вичерпався. 
Магія цих рівнянь залишається загадкою, а ціна за невдачу 
висока».

Раптом магічна енергія посилюється, і вас поглинає вир 
неконтрольованих сил. Ваш зір розпливається, 
і світ навколо розпадається на калейдоскоп фарб.

Ваша пригода закінчується тут, у дезорієнтуючому вирі магії. 
Таємниці підземелля залишаться нерозгаданими, а ваша 
історія завершиться в глибинах невизначеності.

Гра закінчена, відважний авантюрист. Нехай ваш дух знайде 
спокій серед магії, яка зараз оточує вас»."""

game_over = """  ▄▀  ██   █▀▄▀█ ▄███▄       ████▄     ▄   ▄███▄   █▄▄▄▄ 
▄▀    █ █  █ █ █ █▀   ▀      █   █      █  █▀   ▀  █  ▄▀ 
█ ▀▄  █▄▄█ █ ▄ █ ██▄▄        █   █ █     █ ██▄▄    █▀▀▌  
█   █ █  █ █   █ █▄   ▄▀     ▀████  █    █ █▄   ▄▀ █  █  
 ███     █    █  ▀███▀               █  █  ▀███▀     █   
        █    ▀                        █▐            ▀    
       ▀                              ▐                """
print(start)
level_count = 0
earned_points = 0
while True:
    if 4 > level_count > 0:
        print("""
ОБЕРІТЬ ВАШІ НАСТУПНІ ДІЇ:
1.грати наступний рівень
2.показати всю інформацію персонажа (рівень, ім'я, раса, вік, характеристики)
3.змінити ім'я
4.використати додаткові очки характеристик (які були зароблені після проходження рівнів)
5.вийти""")
        choice = int(input(f"Введіть номер операції:{strelochka}"))
        if choice == 1:
            pass
        elif choice == 2 and level_count >= 1:
            print(f"""
Рівень: {level_count}
Ім'я: {name}
Раса: {race}
Вік: {age}
Характеристики:
    Сила - {power}
    Спритність - {agility}
    Інтелект - {intelligence}
""")
            continue
        elif choice == 3 and level_count >= 1:
            name = str(input(f"Змініть ім'я:{strelochka} "))
            continue
        elif choice == 4:
            while True:
                if earned_points == 0:
                    print("\nВИ ЩЕ НЕ ОТРИМУВАЛИ ДОДАТКОВИХ ОЧКІВ. ")
                    break
                else:
                    print(f"Кількість отриманих очків: {earned_points}")
                    upped_power = int(input(f"Збільшіть рівень вашої сили:{strelochka}"))
                    upped_agility = int(input(f"Збільшіть рівень вашої спритності:{strelochka}"))
                    upped_intelligence = int(input(f"Збільшіть рівень вашого інтелекту:{strelochka}"))
                    if earned_points == upped_intelligence + upped_agility + upped_power:
                        power = power + upped_power
                        agility = agility + upped_agility
                        intelligence = intelligence + upped_intelligence
                        break
                    elif earned_points < upped_intelligence + upped_agility + upped_power:
                        print("Перевищів кількість очків")
                    elif earned_points > upped_intelligence + upped_agility + upped_power:
                        print("Не всі очки використані")
            continue
        elif choice == 5:
            print(game_over)
            break

    if level_count == 0:
        points = 10
        print(f"\n{character}")
        name = str(input(f"Як тебе звати, сміливий авантюристе?{strelochka}"))
        race = str(input(f"""Виберіть расу свого персонажа з наступних варіантів:
                - Карлик
                - Ельф
                - Людина
                - Дракононароджений
                - Орк
                - Гоблін
                {strelochka}"""))
        sex = str(input(f"""Ви чоловік, жінка чи бажаєте не говорити?{strelochka}"""))
        age = int(input(f"""Скільки років ви прожили?{strelochka}"""))
        print("Розподіли основні властивості свого персонажа:")
        while True:
            power = int(input(f"Сила:{strelochka} "))
            agility = int(input(f"Спритність:{strelochka} "))
            intelligence = int(input(f"Інтелект:{strelochka} "))
            if points == power + agility + intelligence:

                level_count += 1
                break
            elif points < power + agility + intelligence:
                print("Перевищів кількість очків")
            elif points > power + agility + intelligence:
                print("Не всі очки використані")
        continue
    if level_count == 1:
        print(f"\n{level_1}")
        attempt = 0
        randomN = random.randint(0, 10)
        while attempt < 3:
            print(f"Для полегшення перевірки правильна відповідь - {randomN}")
            inputNum = int(input(strelochka))
            if inputNum > randomN:
                attempt += 1
                print(lower_answer_l1)
            elif inputNum < randomN:
                attempt += 1
                print(bigger_answer_l1)
            elif inputNum == randomN:
                print(victory_lv1)
                earned_points += 10
                level_count += 1
                break
            if attempt == 2:
                print(last_try)
        if attempt == 3:
            print(loosing_lv1)
            print(game_over)
            level_count = -1
        continue
    elif level_count == -1:
        break

    if level_count == 2:
        print(level_2)
        corect_door = random.randint(1, 3)
        not_correct = random.randint(1, 3)
        print(f"Для полегшення перевірки правильна відпоідь - {corect_door}")
        choosen_door = int(input(f"Зроби вибір:{strelochka} "))
        while True:
            if corect_door != not_correct and choosen_door != not_correct:
                while True:
                    print(f"""Ви ретельно робите свій початковий вибір, вказуючи на одну з трьох дверей. 
Голос підтверджує ваш вибір знаючим тоном:

«Чудово, відважний шукаче пригод. Ви вибрали Двері {choosen_door} ».

Поки ви очікуєте відкриття, голос додає:

«Тепер давайте додамо родзинку цьому виклику. Перш ніж я покажу, 
що знаходиться за вибраними вами дверима, 
дозвольте мені зробити речі цікавішими. З двох дверей, що залишилися, 
вам буде показана одна, яка розкриє результат, якого ви б уникали..."

З драматичним розмахом двері {not_correct} відчиняються, 
показуючи кімнату з кровожерливими тиграми. Голос продовжує:

«Розумієте, авантюристе, тепер у вас є унікальна можливість. 
Ви можете залишитися при своєму початковому виборі або 
перейти до інших невідкритих дверей. Рішення за вами»
.
Чи бажаєш ти змінити вибір? Так(1)/Ні(0)
""")

                    choise = int(input(f"Зробіть вибір:{strelochka} "))
                    if choise == 1:
                        choosen_door = int(input(f"Зроби інший вибір вибір:{strelochka} "))
                        break
                    elif choise == 0:
                        break
                if choosen_door == corect_door:
                    print(victory_lv2)
                    level_count += 1
                    earned_points += 10
                    break
                else:
                    level_count = -1
                    print(loosing_lv2)
                    print(game_over)
                    break
            else:
                not_correct = random.randint(1, 3)
        continue
    elif level_count == -1:
        break

    if level_count == 3:
        print(level_3)
        time_per_equation = 60
        level_time = 60
        correct_answers = 0

        while correct_answers < 5 and level_count != -1:
            equation_type = random.choice(['linear', 'quadratic'])
            if equation_type == 'linear':
                a = random.randint(1, 10)
                b = random.randint(1, 10)
                x = round(b / a, 2)
                equation = f"{a}x = {b}"
                answer = x
            else:
                a = random.randint(1, 10)
                b = random.randint(1, 10)
                c = random.randint(1, 10)
                discriminant = b ** 2 - 4 * a * c
                if discriminant < 0:
                    continue
                else:
                    x1 = round((-b + discriminant ** 0.5) / (2 * a), 2)
                    x2 = round((-b - discriminant ** 0.5) / (2 * a), 2)
                    if a != 1:
                        equation = f"{a}x^2 + {b}x + {c} = 0"
                        answer = max(x1, x2)
                    else:
                        equation = f"x^2 + {b}x + {c} = 0"
                        answer = max(x1, x2)
            print(f"Вирішуй рівняння: {equation}")
            print(f"Для полегшення перевірки правльна відповідь - {answer}")
            start_time = level_time
            input_time = level_time
            attempts = 0
            while input_time > 0 and level_count != -1:
                start = time.time()
                player_answer = input(
                      f"Назвіть свою відповіть, мандрівнику (У вас лишилось: {format(input_time, '.0f')} секунд):{strelochka} ")
                end = time.time()
                try:
                    player_answer = float(player_answer)
                except ValueError:
                    print("Спробуй ЩЕ РАЗ!")
                    continue

                error = 0.02
                input_time -= round(end - start, 2)
                if abs(answer - player_answer) < error:
                    print("Чудово, ти збільшуєш ймовірність подолати цей іспит!")
                    correct_answers += 1
                    break
                else:
                    attempts += 1
                    if attempts < 4:
                        print("Спробуй ще раз, поки ти маєш час!!!")
                    if attempts >= 4:
                        print("Спроб було досить. Правильна відповідь: {0}\n".format(answer))
                        print(loosing_lv3)
                        print(game_over)
                        level_count = -1
        if level_count == -1:
            break

        if correct_answers == 5:
            print(victory_lv3)
            print("""На цому моменті наша гра завершується. Чекайте наступних оновлень та дякую Вам за те
що випровели свій час в цій грі!
Команда розробників:
Колко Олександр
Катерина Соловій
Максим Чоботар
                                          """)
            break
    if correct_answers == 5:
        break
    elif level_count == -1:
        break




2



