lis = ([('Александрова', 'Анна', 'Костянтинівна', 'ч', 22),
 ('Биліна', 'Олександра', 'Денисівна', 'ч', 21),
 ('Богусевич', 'Денис', 'Анатолійович', 'ж', 20),
 ('Говядін', 'Кирило', 'Олександрович', 'ж', 20),
 ('Іспірян', 'Анна', 'Самвелівна', 'ж', 20),
 ('Качуровська', 'Юлія', 'Сергіївна', 'ж', 20),
 ('Ковальчук', 'Анна', 'Миколаївна', 'ч', 21),
 ('Колко', 'Олександр', 'Олександрович', 'ч', 22),
 ('Кухарук', 'Соломія', 'Тарасівна', 'ж', 19),
 ('Міхуровська', 'Наталія', 'Іванівна', 'ж', 20),
 ('Нгуєн', 'Фу', 'Даі', 'ч', 23),
 ('Ромашко', 'Георгій', 'Романович', 'ж', 19),
 ('Соловій', 'Катерина', 'Ігорівна', 'ч', 23),
 ('Сугоняк', 'Роман', 'Ярославович', 'ч', 17),
 ('Судейко', 'Ілля', 'Юрійович', 'ж', 21),
 ('Ужвенко', 'Юлія', 'Константинівна', 'ч', 19),
 ('Чоботар', 'Максим', 'Сергійович', 'ч', 20),
 ('Чучман', 'Олександр', 'Олександрович', 'ж', 18),
 ('Щур', 'Олександр', 'Олегович', 'ж', 23),
 ('Студент', 'Приклад', 'Надіславович', 'ж', 18),
 ('Німець', 'Надіслав', 'Вікторович', 'ч', 17)])
female_names = []
male_names = []
for el in lis:
    if "ч" in el:
        male_names.append(el[1])
    elif "ж" in el:
        female_names.append(el[1])
count_fem_names = [female_names.count(name) for name in female_names ]
count_male_names = [male_names.count(name) for name in male_names]
print(f"Найбільш поширине чоловіче ім'я - {male_names[count_male_names.index(max(count_male_names))]} {max(count_male_names)}")
print(f"Найбільш поширине жіноче ім'я - {female_names[count_fem_names.index(max(count_fem_names))]} {max(count_fem_names)}")